#==============================================================================
# ★ 名前入力改造
#------------------------------------------------------------------------------
# ver.1.02
# by nz_prism
# https://github.com/nz-prism/VXAce-Scripts/blob/master/NameInput.rb
#------------------------------------------------------------------------------
# ■ 基本使用方法
# 1. スクリプトエディタにて、「▼ 素材」以下に新規セクションを挿入してください。
#    「オプション画面」を導入している場合、その下に挿入してください。
# 2. 1 のセクションにこのスクリプト全体を貼り付けてください。
# 3. 必要なら以下のカスタマイズセクションにて、お好みの設定に変更してください。
# 
# このスクリプトは 640 * 480 の解像度にも対応しており、解像度が大きいほうがより
# 見やすくなります。
# 
# 
# ■ アクターの「姓」・姓名の順序について
# 　アクターにデフォルトの「姓」を設定する場合、アクターのメモ欄に
# 「 *姓[山田] 」のように入力すれば設定できます。
# 　同様に、アクターのメモ欄に
# 「 *姓名逆転 」と入力すると、そのアクターは「姓→名」の順序がデフォルトとなり
# ます（何も入力しなければ「名→姓」の順序がデフォルトです）。
# 
# ■ 制御文字について
# 　このスクリプトを導入することにより、以下の制御文字の仕様がデフォルトから変更
# されます。大文字か小文字か、半角文字か全角文字かによって表示される文字が変化す
# るようになります。
# 　なおカスタマイズセクションにて「姓」を使用しないことを選択した場合は、大文
# 字・小文字、半角・全角いずれも区別なくデフォルト通りに表示されます。
# 
# 
# 　\N[n]  （半角） : アクター n 番のフルネームに置き換えます。
# 　\Ｎ[n] （全角） : アクター n 番のフルネームに置き換えます。
# 
# 　\n[n]  （半角） : アクター n 番の「名」に置き換えます。
# 　\ｎ[n] （全角） : アクター n 番の「姓」に置き換えます。
# 
# 
# 　\P[n]  （半角） : パーティメンバー n 番（並び順）のフルネームに置き換えます。
# 　\Ｐ[n] （全角） : パーティメンバー n 番（並び順）のフルネームに置き換えます。
# 
# 　\p[n]  （半角） : パーティメンバー n 番（並び順）の「名」に置き換えます。
# 　\ｐ[n] （全角） : パーティメンバー n 番（並び順）の「姓」に置き換えます。
#------------------------------------------------------------------------------
# 本素材はMITライセンスにてリリースされています。
# https://opensource.org/licenses/mit-license.php
#------------------------------------------------------------------------------
# 2014/04/21 ver.1.02 微バグの修正
# 2014/04/20 ver.1.01 制御文字を「姓」に対応させるなど、諸機能追加
# 2012/11/04 ver.1.00 公開
#==============================================================================

class Scene_Name
#==============================================================================
# ★ カスタマイズセクション
#------------------------------------------------------------------------------
# 以下の各設定をユーザーの好みに応じて変更できます。 = の右辺の数値や文字列を
# 任意に変更してください。 " " で囲まれた部分以外は全角文字を入力しないでくださ
# い。 [ ] や { } 、 " " や , などの記号を消さないでください。
#==============================================================================

  # 姓を使用するかどうか
  # 使用しないなら true を false に書き換えてください
  UseLastName = true
  
  
  # 以下は姓を使用する際のオプションです
  
  # フルネーム表示時、姓名を区切る文字
  # 区切り文字を使用せずに姓名を連続して表示させたい場合、 "" （空文字列）にして
  # ください
  
  # 「名→姓」順のとき（例 : ジョン[名]・スミス[姓]）
  StringBetweenNames1 = "・"
  
  # 「姓→名」順のとき（例 : 山田[姓]　太郎[名]）
  StringBetweenNames2 = "　"
  
  
  # 「姓と名を逆にする」コマンドを使用するかどうか
  # 使用しないなら true を false に書き換えてください
  UseReverseNames = true
  
  
  # 常に「名」から入力を始めるかどうか
  # 「姓名逆転」アクターの場合は「姓」から入力開始にするなら、
  # true を false に書き換えてください
  FirstNameStart = true
  
  
  
#------------------------------------------------------------------------------
# ★ カスタマイズここまで
#------------------------------------------------------------------------------
end
#------------------------------------------------------------------------------
class Game_Actor
  attr_accessor :last_name                # 姓
  attr_accessor :reverse_name_order       # 姓名逆転フラグ
  #--------------------------------------------------------------------------
  # ○ セットアップ
  #--------------------------------------------------------------------------
  alias :nzprism_name_setup :setup
  def setup(actor_id)
    nzprism_name_setup(actor_id)
    note = actor.note
    if /\*(?:姓|[名苗]字|(?:ラスト|ファミリー)ネーム)\s*\[(.*)\]/ =~ note
      @last_name = $1
    else
      @last_name = ""
    end
    @reverse_name_order = !!(/\*姓名逆転/ =~ note)
  end
  #--------------------------------------------------------------------------
  # ★ 正式名称の取得
  #--------------------------------------------------------------------------
  def full_name
    return @name if @last_name.empty?
    if @reverse_name_order
      return @last_name + Scene_Name::StringBetweenNames2 + @name
    else
      return @name + Scene_Name::StringBetweenNames1 + @last_name
    end
  end
end
#------------------------------------------------------------------------------
class Window_Base
  #--------------------------------------------------------------------------
  # ○ 制御文字の事前変換
  #    実際の描画を始める前に、原則として文字列に変わるものだけを置き換える。
  #    文字「\」はエスケープ文字（\e）に変換。
  #--------------------------------------------------------------------------
  def convert_escape_characters(text)
    result = text.to_s.clone
    result.gsub!(/\\/)            { "\e" }
    result.gsub!(/\e\e/)          { "\\" }
    result.gsub!(/\eV\[(\d+)\]/i) { $game_variables[$1.to_i] }
    result.gsub!(/\eV\[(\d+)\]/i) { $game_variables[$1.to_i] }
    result.gsub!(/\eN\[(\d+)\]/)  { actor_name($1.to_i, 2) }
    result.gsub!(/\eＮ\[(\d+)\]/) { actor_name($1.to_i, 2) }
    result.gsub!(/\en\[(\d+)\]/)  { actor_name($1.to_i, 0) }
    result.gsub!(/\eｎ\[(\d+)\]/) { actor_name($1.to_i, 1) }
    result.gsub!(/\eP\[(\d+)\]/)  { party_member_name($1.to_i, 2) }
    result.gsub!(/\eＰ\[(\d+)\]/) { party_member_name($1.to_i, 2) }
    result.gsub!(/\ep\[(\d+)\]/)  { party_member_name($1.to_i, 0) }
    result.gsub!(/\eｐ\[(\d+)\]/) { party_member_name($1.to_i, 1) }
    result.gsub!(/\eG/i)          { Vocab::currency_unit }
    result
  end
  #--------------------------------------------------------------------------
  # ○ アクター n 番の名前を取得
  #--------------------------------------------------------------------------
  alias :nzprism_name_actor_name :actor_name
  def actor_name(n, type = 0)
    return nzprism_name_actor_name(n) if type == 0 or !Scene_Name::UseLastName
    return "" unless actor = (n > 0) ? $game_actors[n] : nil
    return (type == 2) ? actor.full_name : actor.last_name
  end
  #--------------------------------------------------------------------------
  # ○ パーティメンバー n 番の名前を取得
  #--------------------------------------------------------------------------
  alias :nzprism_name_party_member_name :party_member_name
  def party_member_name(n, type = 0)
    return nzprism_name_party_member_name(n) if type == 0 or !Scene_Name::UseLastName
    return "" unless actor = (n >= 1) ? $game_party.members[n - 1] : nil
    return (type == 2) ? actor.full_name : actor.last_name
  end
end
#------------------------------------------------------------------------------
class Window_Status
  #--------------------------------------------------------------------------
  # ☆ 名前の描画
  #--------------------------------------------------------------------------
  alias :nzprism_name_draw_actor_name :draw_actor_name
  def draw_actor_name(actor, x, y, width = 240)
    if Scene_Name::UseLastName
      change_color(hp_color(actor))
      draw_text(x, y, width, line_height, actor.full_name)
    else
      nzprism_name_draw_actor_name(actor, x, y, width)
    end
  end
  #--------------------------------------------------------------------------
  # ○ ブロック 1 の描画
  #--------------------------------------------------------------------------
  alias :nzprism_name_draw_block1 :draw_block1
  def draw_block1(y)
    if Scene_Name::UseLastName
      draw_actor_name(@actor, 4, y)
      draw_actor_class(@actor, 256, y)
      draw_actor_nickname(@actor, 400, y)
    else
      nzprism_name_draw_block1(y)
    end
  end
end
#------------------------------------------------------------------------------
class Window_NameEdit
  #--------------------------------------------------------------------------
  # ○ オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(actor, max_char, x = nil, last = false)
    @last = last
    if Scene_Name::UseLastName
      width = Graphics.width / 2
      height = 56
    else
      width = 360
      height = fitting_height(4)
    end
    x ||= (Graphics.width - width) / 2
    y = (Graphics.height - 264 - height) / 2
    super(x, y, width, height)
    @actor = actor
    @max_char = max_char
    if @last
      @default_name = @name = actor.last_name[0, @max_char]
      deactivate if Scene_Name::FirstNameStart || !actor.reverse_name_order
    else
      @default_name = @name = actor.name[0, @max_char]
      deactivate if !Scene_Name::FirstNameStart && actor.reverse_name_order
    end
    @index = @name.size
    refresh
  end
  #--------------------------------------------------------------------------
  # ☆ 標準パディングサイズの取得
  #--------------------------------------------------------------------------
  alias :nzprism_name_standard_padding :standard_padding
  def standard_padding
    Scene_Name::UseLastName ? 8 : nzprism_name_standard_padding
  end
  #--------------------------------------------------------------------------
  # ○ 文字の幅を取得
  #--------------------------------------------------------------------------
  def char_width
    text_size("あ").width 
  end
  #--------------------------------------------------------------------------
  # ○ 名前を描画する左端の座標を取得
  #--------------------------------------------------------------------------
  alias :nzprism_name_left :left
  def left
    if Scene_Name::UseLastName
      name_center = (contents_width + char_width * 2) / 2
      name_width = (@max_char + 1) * char_width
      return [name_center - name_width / 2, contents_width - name_width].min
    else
      return nzprism_name_left
    end
  end
  #--------------------------------------------------------------------------
  # ○ 項目を描画する矩形の取得
  #--------------------------------------------------------------------------
  alias :nzprism_name_item_rect :item_rect
  def item_rect(index)
    rect = nzprism_name_item_rect(index)
    rect.y = 12 if Scene_Name::UseLastName
    rect
  end
  #--------------------------------------------------------------------------
  # ○ リフレッシュ
  #--------------------------------------------------------------------------
  alias :nzprism_name_refresh :refresh
  def refresh
    if Scene_Name::UseLastName
      contents.clear
      str = @last ? "姓" : "名"
      change_color(system_color)
      draw_text(left - char_width * 2, 12, char_width, line_height, str)
      change_color(normal_color)
      @max_char.times{|i| draw_underline(i) }
      @name.size.times{|i| draw_char(i) }
      active ? cursor_rect.set(item_rect(@index)) : cursor_rect.empty
    else
      nzprism_name_refresh
    end
  end
end
#------------------------------------------------------------------------------
class Scene_Name < Scene_MenuBase
  #--------------------------------------------------------------------------
  # ○ 開始処理
  #--------------------------------------------------------------------------
  def start
    super
    @actor = $game_actors[@actor_id]
    if UseLastName
      @reverse_name_order = @actor.reverse_name_order
      if @reverse_name_order
        fx = Graphics.width / 2
        lx = 0
      else
        fx = 0
        lx = Graphics.width / 2
      end
      @f_edit_window = Window_NameEdit.new(@actor, @max_char, fx, false)
      @l_edit_window = Window_NameEdit.new(@actor, @max_char, lx, true)
      edit_window = @l_edit_window.active ? @l_edit_window : @f_edit_window
      @kanji_window  = Window_KanjiInput.new(edit_window)
      @kana_window   = Window_KanaInput.new(edit_window, @kanji_window)
    else
      @edit_window  = Window_NameEdit.new(@actor, @max_char)
      @kanji_window = Window_KanjiInput.new(@edit_window)
      @kana_window  = Window_KanaInput.new(@edit_window, @kanji_window)
    end
    @command_window = Window_NameCommand.new(@kana_window)
    @command_window.set_handler(:hiragana, method(:process_hiragana))
    @command_window.set_handler(:katakana, method(:process_katakana))
    @command_window.set_handler(:alphabet, method(:process_alphabet))
    @command_window.set_handler(:kanji,    method(:process_kanji))
    @command_window.set_handler(:ok,       method(:process_ok))
    @command_window.set_handler(:cancel,   method(:process_cancel))
    @kana_window.set_handler(:ok,      method(:on_kana_ok))
    @kana_window.set_handler(:cancel,  method(:on_kana_cancel))
    @kanji_window.set_handler(:ok,     method(:on_kanji_ok))
    @kanji_window.set_handler(:cancel, method(:on_kanji_cancel))
  end
  #--------------------------------------------------------------------------
  # ☆ フレーム更新
  #--------------------------------------------------------------------------
  def update
    super
    update_input
  end
  #--------------------------------------------------------------------------
  # ★ 入力の更新
  #--------------------------------------------------------------------------
  def update_input
    if UseLastName
      unless @kanji_window.active
        return process_left  if Input.trigger?(:L)
        return process_right if Input.trigger?(:R)
      end
      if UseReverseNames
        return process_reverse if Input.trigger?(:X) || Input.trigger?(:Y)
      end
    end
    return process_cancel  if Input.repeat?(:A)
    return process_ok      if Input.trigger?(:Z)
  end
  #--------------------------------------------------------------------------
  # ★ 姓名切り替え : 左
  #--------------------------------------------------------------------------
  def process_left
    if @reverse_name_order
      @kana_window.edit_window = @kanji_window.edit_window = @l_edit_window
      Sound.play_cursor if @f_edit_window.active
      @l_edit_window.activate
      @f_edit_window.deactivate
    else
      @kana_window.edit_window = @kanji_window.edit_window = @f_edit_window
      Sound.play_cursor if @l_edit_window.active
      @f_edit_window.activate
      @l_edit_window.deactivate
    end
    @f_edit_window.refresh
    @l_edit_window.refresh
  end
  #--------------------------------------------------------------------------
  # ★ 姓名切り替え : 右
  #--------------------------------------------------------------------------
  def process_right
    if @reverse_name_order
      @kana_window.edit_window = @kanji_window.edit_window = @f_edit_window
      Sound.play_cursor if @l_edit_window.active
      @f_edit_window.activate
      @l_edit_window.deactivate
    else
      @kana_window.edit_window = @kanji_window.edit_window = @l_edit_window
      Sound.play_cursor if @f_edit_window.active
      @l_edit_window.activate
      @f_edit_window.deactivate
    end
    @f_edit_window.refresh
    @l_edit_window.refresh
  end
  #--------------------------------------------------------------------------
  # ★ 姓名逆転
  #--------------------------------------------------------------------------
  def process_reverse
    @reverse_name_order = !@reverse_name_order
    if @reverse_name_order
      @f_edit_window.x = Graphics.width / 2
      @l_edit_window.x = 0
    else
      @f_edit_window.x = 0
      @l_edit_window.x = Graphics.width / 2
    end
    Sound.play_cursor
  end
  #--------------------------------------------------------------------------
  # ★ コマンドウィンドウ決定時の処理
  #--------------------------------------------------------------------------
  def process_character(page)
    @kana_window.change_page(page)
    @kana_window.select_last
    @kana_window.activate
  end
  #--------------------------------------------------------------------------
  # ★ 各種コマンド
  #--------------------------------------------------------------------------
  def process_hiragana; process_character(0); end    # かな
  def process_katakana; process_character(1); end    # カナ
  def process_alphabet; process_character(2); end    # 英数
  def process_kanji;    process_character(3); end    # 漢字
  #--------------------------------------------------------------------------
  # ★ 完了
  #--------------------------------------------------------------------------
  alias :nzprism_name_on_input_ok :on_input_ok
  def process_ok
    if UseLastName
      if @f_edit_window.name.empty?
        if @f_edit_window.restore_default
          Sound.play_ok
        else
          Sound.play_buzzer
        end
        unless @kana_window.active or @kanji_window.active
          @command_window.activate
        end
      else
        Sound.play_ok
        @actor.name = @f_edit_window.name
        @actor.last_name  = @l_edit_window.name
        @actor.reverse_name_order = @reverse_name_order
        return_scene
      end
    else
      if @edit_window.name.empty?
        if @edit_window.restore_default
          Sound.play_ok
        else
          Sound.play_buzzer
        end
        unless @kana_window.active or @kanji_window.active
          @command_window.activate
        end
      else
        Sound.play_ok
        nzprism_name_on_input_ok
      end
    end
  end
  #--------------------------------------------------------------------------
  # ★ 消去
  #--------------------------------------------------------------------------
  def process_cancel
    if UseLastName
      if @f_edit_window.active
        Sound.play_cancel if @f_edit_window.back
      else
        Sound.play_cancel if @l_edit_window.back
      end
    else
      Sound.play_cancel if @edit_window.back
    end
  end
  #--------------------------------------------------------------------------
  # ★ 仮名［決定］
  #--------------------------------------------------------------------------
  def on_kana_ok
    if @command_window.current_symbol == :kanji
      if @kana_window.on_kanji_select
        @kanji_window.select_last
        @kanji_window.show
        @kanji_window.activate
        @kana_window.deactivate
      end
    else
      @kana_window.on_name_add if !@kana_window.character.empty?
    end
  end
  #--------------------------------------------------------------------------
  # ★ 仮名［キャンセル］
  #--------------------------------------------------------------------------
  def on_kana_cancel
    @command_window.activate
    @kana_window.unselect
  end
  #--------------------------------------------------------------------------
  # ★ 漢字［決定］
  #--------------------------------------------------------------------------
  def on_kanji_ok
    @kanji_window.on_name_add if !@kanji_window.character.empty?
  end
  #--------------------------------------------------------------------------
  # ★ 漢字［キャンセル］
  #--------------------------------------------------------------------------
  def on_kanji_cancel
    @kana_window.activate
    @kanji_window.unselect
    @kanji_window.hide
  end
end

#==============================================================================
# ★ Window_NameInputBase
#------------------------------------------------------------------------------
# 　名前入力画面で、文字を選択するウィンドウのスーパークラスです。
#==============================================================================

class Window_NameInputBase < Window_Selectable
  #--------------------------------------------------------------------------
  # ● 公開インスタンス変数
  #--------------------------------------------------------------------------
  attr_writer   :edit_window
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(x, y, width, height, edit_window)
    @page = 0
    super(x, y, width, height)
    @edit_window = edit_window
    @index = 0
    refresh
    update_cursor
    deactivate
    unselect
  end
  #--------------------------------------------------------------------------
  # ● 文字の取得
  #--------------------------------------------------------------------------
  def character
    table[@page][@index]
  end
  #--------------------------------------------------------------------------
  # ● 項目数の取得
  #--------------------------------------------------------------------------
  def item_max
    table[@page].size
  end
  #--------------------------------------------------------------------------
  # ● 項目の選択解除
  #--------------------------------------------------------------------------
  def unselect
    @last_index = @index
    super
  end
  #--------------------------------------------------------------------------
  # ● 最後に選んだ項目を選択
  #--------------------------------------------------------------------------
  def select_last
    select((@last_index >= item_max) ? 0 : @last_index)
  end
  #--------------------------------------------------------------------------
  # ● 項目の描画
  #--------------------------------------------------------------------------
  def draw_item(index)
    draw_text(item_rect(index), table[@page][index], 1)
  end
  #--------------------------------------------------------------------------
  # ● ページ変更
  #--------------------------------------------------------------------------
  def change_page(page)
    @page = page
    refresh
  end
  #--------------------------------------------------------------------------
  # ● 名前に文字を追加
  #--------------------------------------------------------------------------
  def on_name_add
    if @edit_window.add(character)
      Sound.play_ok
    else
      Sound.play_buzzer
    end
  end
  #--------------------------------------------------------------------------
  # ● 決定ボタンが押されたときの処理
  #--------------------------------------------------------------------------
  def process_ok
    if current_item_enabled?
      Sound.play_ok
      Input.update
      call_ok_handler
    else
      Sound.play_buzzer
    end
  end
  #--------------------------------------------------------------------------
  # ● カーソルを下に移動
  #     wrap : ラップアラウンド許可
  #--------------------------------------------------------------------------
  def cursor_down(wrap = false)
    if row_max > 1
      n = @index + col_max
      if n > item_max - 1
        if wrap
          select(n % col_max)
        end
      else
        select(n)
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● カーソルを上に移動
  #     wrap : ラップアラウンド許可
  #--------------------------------------------------------------------------
  def cursor_up(wrap = false)
    if row_max > 1
      n = @index - col_max
      if n < 0
        if wrap
          n = (row_max - 1) * col_max + @index
          if n > item_max - 1
            select(n - col_max)
          else
            select(n)
          end
        end
      else
        select(n)
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● カーソルを右に移動
  #     wrap : ラップアラウンド許可
  #--------------------------------------------------------------------------
  def cursor_right(wrap = false)
    if item_max > 1
      n = col_max - 1
      if @index % col_max < n
        if @index == item_max - 1
          select((row_max - 1) * col_max) if wrap
        else
          select(@index + 1)
        end
      elsif wrap
        select(@index - n)
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● カーソルを左に移動
  #     wrap : ラップアラウンド許可
  #--------------------------------------------------------------------------
  def cursor_left(wrap = false)
    if item_max > 1
      if @index % col_max > 0
        select(@index - 1)
      elsif wrap
        select([@index + col_max - 1, item_max - 1].min)
      end
    end
  end
end

#==============================================================================
# ★ Window_KanaInput
#------------------------------------------------------------------------------
# 　名前入力画面で、文字を選択するウィンドウです。
#==============================================================================

class Window_KanaInput < Window_NameInputBase
  #--------------------------------------------------------------------------
  # ● 定数（各操作説明文）
  #--------------------------------------------------------------------------
  lr = "\\C[14]L R \\C[0]"
  lr_short = lr + "切替"
  lr_long  = lr + "姓名入力切り替え"
  lr = Hash.new(lr_short)
  lr[640] = lr_long
  xy = "\\C[14]X Y \\C[0]"
  xy_short = xy + "逆転"
  xy_long  = xy + "姓と名を逆にする"
  xy = Hash.new(xy_short)
  xy[640] = xy_long
  a = " \\C[14]A  \\C[0]"
  a_short = a + "消去"
  a_long  = a + "一文字消去"
  a = Hash.new(a_short)
  a[640] = a_long
  z = " \\C[14]Z  \\C[0]"
  z_short = z + "完了"
  z_long  = z + "名前入力の完了"
  z = Hash.new(z_short)
  z[640] = z_long
  INSTRUCTION_C = " \\C[14]C  \\C[0]決定"
  INSTRUCTION_B = " \\C[14]B  \\C[0]戻る"
  INSTRUCTIONS_LR = lr
  INSTRUCTIONS_XY = xy
  INSTRUCTIONS_A  = a
  INSTRUCTIONS_Z  = z
  #--------------------------------------------------------------------------
  # ● 文字表（日本語）
  #--------------------------------------------------------------------------
  JAPAN1 = [ 'あ','い','う','え','お',  'が','ぎ','ぐ','げ','ご',
             'か','き','く','け','こ',  'ざ','じ','ず','ぜ','ぞ',
             'さ','し','す','せ','そ',  'だ','ぢ','づ','で','ど',
             'た','ち','つ','て','と',  'ば','び','ぶ','べ','ぼ',
             'な','に','ぬ','ね','の',  'ぱ','ぴ','ぷ','ぺ','ぽ',
             'は','ひ','ふ','へ','ほ',  'ぁ','ぃ','ぅ','ぇ','ぉ',
             'ま','み','む','め','も',  'っ','ゃ','ゅ','ょ','ゎ',
             'や','　','ゆ','　','よ',  'ん','～','々','（','）',
             'ら','り','る','れ','ろ',  '・','、','。','「','」',
             'わ','ゐ','ゔ','ゑ','を',  '○','△','□','◇','☆']
  JAPAN2 = [ 'ア','イ','ウ','エ','オ',  'ガ','ギ','グ','ゲ','ゴ',
             'カ','キ','ク','ケ','コ',  'ザ','ジ','ズ','ゼ','ゾ',
             'サ','シ','ス','セ','ソ',  'ダ','ヂ','ヅ','デ','ド',
             'タ','チ','ツ','テ','ト',  'バ','ビ','ブ','ベ','ボ',
             'ナ','ニ','ヌ','ネ','ノ',  'パ','ピ','プ','ペ','ポ',
             'ハ','ヒ','フ','ヘ','ホ',  'ァ','ィ','ゥ','ェ','ォ',
             'マ','ミ','ム','メ','モ',  'ッ','ャ','ュ','ョ','ヮ',
             'ヤ','　','ユ','　','ヨ',  'ン','ー','仝','［','］',
             'ラ','リ','ル','レ','ロ',  '／','，','．','『','』',
             'ワ','ヰ','ヴ','ヱ','ヲ',  '●','▲','■','◆','★']
  JAPAN3 = [ 'Ａ','Ｂ','Ｃ','Ｄ','Ｅ',  'ａ','ｂ','ｃ','ｄ','ｅ',
             'Ｆ','Ｇ','Ｈ','Ｉ','Ｊ',  'ｆ','ｇ','ｈ','ｉ','ｊ',
             'Ｋ','Ｌ','Ｍ','Ｎ','Ｏ',  'ｋ','ｌ','ｍ','ｎ','ｏ',
             'Ｐ','Ｑ','Ｒ','Ｓ','Ｔ',  'ｐ','ｑ','ｒ','ｓ','ｔ',
             'Ｕ','Ｖ','Ｗ','Ｘ','Ｙ',  'ｕ','ｖ','ｗ','ｘ','ｙ',
             'Ｚ','　','±','％','℃',  'ｚ','　','…','“','”',
             '０','１','２','３','４',  '＆','＃','＠','＊','∀',
             '５','６','７','８','９',  '＼','↑','！','？','♪',
             '∞','＋','－','×','÷',  '←','※','→','♂','♀',
             '＝','＜','＞','＾','｜',  '◎','↓','＿','；','：']
  JAPAN4 = [ 'あ','い','う','え','お',
             'か','き','く','け','こ',
             'さ','し','す','せ','そ',
             'た','ち','つ','て','と',
             'な','に','ぬ','ね','の',
             'は','ひ','ふ','へ','ほ',
             'ま','み','む','め','も',
             'や','　','ゆ','　','よ',
             'ら','り','る','れ','ろ',
             'わ']
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(edit_window, kanji_window)
    y = edit_window.y + edit_window.height
    width = Graphics.width - 72
    super(72, y, width, 264, edit_window)
    @kanji_window = kanji_window
  end
  #--------------------------------------------------------------------------
  # ● 文字表の取得
  #--------------------------------------------------------------------------
  def table
    [JAPAN1, JAPAN2, JAPAN3, JAPAN4]
  end
  #--------------------------------------------------------------------------
  # ● 桁数の取得
  #--------------------------------------------------------------------------
  def col_max
    (@page == 3) ? 5 : 10
  end
  #--------------------------------------------------------------------------
  # ● 項目を描画する矩形の取得
  #--------------------------------------------------------------------------
  def item_rect(index)
    rect = super
    rect.x = index % col_max * 32 + index % col_max / 5 * 16
    rect.width = 32
    rect
  end
  #--------------------------------------------------------------------------
  # ● 全項目の描画
  #--------------------------------------------------------------------------
  def draw_all_items
    draw_vert_line(332, system_color, 120)
    draw_instructions
    super
  end
  #--------------------------------------------------------------------------
  # ● 漢字選択時の処理
  #--------------------------------------------------------------------------
  def on_kanji_select
    unless [36, 38].include?(@index)
      @kanji_window.change_page(@index)
      return true
    else
      return false
    end
  end
  #--------------------------------------------------------------------------
  # ● 垂直線の描画
  #--------------------------------------------------------------------------
  def draw_vert_line(x, color = normal_color, alpha = 48)
    line_x = x + line_height / 2 - 1
    color.alpha = alpha
    contents.fill_rect(line_x, 0, 2, contents_height, color)
  end
  #--------------------------------------------------------------------------
  # ● 説明の描画
  #--------------------------------------------------------------------------
  def draw_instructions(x = 360)
    width = Graphics.width
    if Scene_Name::UseLastName
      draw_text_ex(x, 0,   INSTRUCTION_C)
      draw_text_ex(x, 36,  INSTRUCTION_B)
      if Scene_Name::UseReverseNames
        draw_text_ex(x, 96,  INSTRUCTIONS_LR[width])
        draw_text_ex(x, 132, INSTRUCTIONS_XY[width])
      else
        draw_text_ex(x, 114, INSTRUCTIONS_LR[width])
      end
      draw_text_ex(x, 180, INSTRUCTIONS_A[width])
      draw_text_ex(x, 216, INSTRUCTIONS_Z[width])
    else
      draw_text_ex(x, 36,  INSTRUCTION_C)
      draw_text_ex(x, 72,  INSTRUCTION_B)
      draw_text_ex(x, 132, INSTRUCTIONS_A[width])
      draw_text_ex(x, 168, INSTRUCTIONS_Z[width])
    end
  end
end

#==============================================================================
# ★ Window_KanjiInput
#------------------------------------------------------------------------------
# 　名前入力画面で、漢字を選択するウィンドウです。
#==============================================================================

class Window_KanjiInput < Window_NameInputBase
  #--------------------------------------------------------------------------
  # ● 文字表（漢字）
  #--------------------------------------------------------------------------
  KANJI_A  = ['亜', '唖', '娃', '阿', '哀', '愛', '挨', '姶', '逢', '葵', '茜',
              '穐', '悪', '握', '渥', '旭', '葦', '芦', '鯵', '梓', '圧', '斡',
              '扱', '宛', '姐', '虻', '飴', '絢', '綾', '鮎', '或', '粟', '袷',
              '安', '庵', '按', '暗', '案', '闇', '鞍', '杏']
  
  KANJI_I  = ['以', '伊', '位', '依', '偉', '囲', '夷', '委', '威', '尉', '惟',
              '意', '慰', '易', '椅', '為', '畏', '異', '移', '維', '緯', '胃',
              '萎', '衣', '謂', '違', '遺', '医', '井', '亥', '域', '育', '郁',
              '磯', '一', '壱', '溢', '逸', '稲', '茨', '芋', '鰯', '允', '印',
              '咽', '員', '因', '姻', '引', '飲', '淫', '胤', '蔭', '院', '陰',
              '隠', '韻', '吋']
  
  KANJI_U  = ['右', '宇', '烏', '羽', '迂', '雨', '卯', '鵜', '窺', '丑', '碓',
              '臼', '渦', '嘘', '唄', '欝', '蔚', '鰻', '姥', '厩', '浦', '瓜',
              '閏', '噂', '云', '運', '雲']
  
  KANJI_E  = ['荏', '餌', '叡', '営', '嬰', '影', '映', '曳', '栄', '永', '泳',
              '洩', '瑛', '盈', '穎', '頴', '英', '衛', '詠', '鋭', '液', '疫',
              '益', '駅', '悦', '謁', '越', '閲', '榎', '厭', '円', '園', '堰',
              '奄', '宴', '延', '怨', '掩', '援', '沿', '演', '炎', '焔', '煙',
              '燕', '猿', '縁', '艶', '苑', '薗', '遠', '鉛', '鴛', '塩']
  
  KANJI_O  = ['於', '汚', '甥', '凹', '央', '奥', '往', '応', '押', '旺', '横',
              '欧', '殴', '王', '翁', '襖', '鴬', '鴎', '黄', '岡', '沖', '荻',
              '億', '屋', '憶', '臆', '桶', '牡', '乙', '俺', '卸', '恩', '温',
              '穏', '音']
  
  KANJI_KA = ['下', '化', '仮', '何', '伽', '価', '佳', '加', '可', '嘉', '夏',
              '嫁', '家', '寡', '科', '暇', '果', '架', '歌', '河', '火', '珂',
              '禍', '禾', '稼', '箇', '花', '苛', '茄', '荷', '華', '菓', '蝦',
              '課', '嘩', '貨', '迦', '過', '霞', '蚊', '俄', '峨', '我', '牙',
              '画', '臥', '芽', '蛾', '賀', '雅', '餓', '駕', '介', '会', '解',
              '回', '塊', '壊', '廻', '快', '怪', '悔', '恢', '懐', '戒', '拐',
              '改', '魁', '晦', '械', '海', '灰', '界', '皆', '絵', '芥', '蟹',
              '開', '階', '貝', '凱', '劾', '外', '咳', '害', '崖', '慨', '概',
              '涯', '碍', '蓋', '街', '該', '鎧', '骸', '浬', '馨', '蛙', '垣',
              '柿', '蛎', '鈎', '劃', '嚇', '各', '廓', '拡', '撹', '格', '核',
              '殻', '獲', '確', '穫', '覚', '角', '赫', '較', '郭', '閣', '隔',
              '革', '学', '岳', '楽', '額', '顎', '掛', '笠', '樫', '橿', '梶',
              '鰍', '潟', '割', '喝', '恰', '括', '活', '渇', '滑', '葛', '褐',
              '轄', '且', '鰹', '叶', '椛', '樺', '鞄', '株', '兜', '竃', '蒲',
              '釜', '鎌', '噛', '鴨', '栢', '茅', '萱', '粥', '刈', '苅', '瓦',
              '乾', '侃', '冠', '寒', '刊', '勘', '勧', '巻', '喚', '堪', '姦',
              '完', '官', '寛', '干', '幹', '患', '感', '慣', '憾', '換', '敢',
              '柑', '桓', '棺', '款', '歓', '汗', '漢', '澗', '潅', '環', '甘',
              '監', '看', '竿', '管', '簡', '緩', '缶', '翰', '肝', '艦', '莞',
              '観', '諌', '貫', '還', '鑑', '間', '閑', '関', '陥', '韓', '館',
              '舘', '丸', '含', '岸', '巌', '玩', '癌', '眼', '岩', '翫', '贋',
              '雁', '頑', '顔', '願']
  
  KANJI_KI = ['企', '伎', '危', '喜', '器', '基', '奇', '嬉', '寄', '岐', '希',
              '幾', '忌', '揮', '机', '旗', '既', '期', '棋', '棄', '機', '帰',
              '毅', '気', '汽', '畿', '祈', '季', '稀', '紀', '徽', '規', '記',
              '貴', '起', '軌', '輝', '飢', '騎', '鬼', '亀', '偽', '儀', '妓',
              '宜', '戯', '技', '擬', '欺', '犠', '疑', '祇', '義', '蟻', '誼',
              '議', '掬', '菊', '鞠', '吉', '吃', '喫', '桔', '橘', '詰', '砧',
              '杵', '黍', '却', '客', '脚', '虐', '逆', '丘', '久', '仇', '休',
              '及', '吸', '宮', '弓', '急', '救', '朽', '求', '汲', '泣', '灸',
              '球', '究', '窮', '笈', '級', '糾', '給', '旧', '牛', '去', '居',
              '巨', '拒', '拠', '挙', '渠', '虚', '許', '距', '鋸', '漁', '禦',
              '魚', '亨', '享', '京', '供', '侠', '僑', '兇', '競', '共', '凶',
              '協', '匡', '卿', '叫', '喬', '境', '峡', '強', '彊', '怯', '恐',
              '恭', '挟', '教', '橋', '況', '狂', '狭', '矯', '胸', '脅', '興',
              '蕎', '郷', '鏡', '響', '饗', '驚', '仰', '凝', '尭', '暁', '業',
              '局', '曲', '極', '玉', '桐', '粁', '僅', '勤', '均', '巾', '錦',
              '斤', '欣', '欽', '琴', '禁', '禽', '筋', '緊', '芹', '菌', '衿',
              '襟', '謹', '近', '金', '吟', '銀']
  
  KANJI_KU = ['九', '倶', '句', '区', '狗', '玖', '矩', '苦', '躯', '駆', '駈',
              '駒', '具', '愚', '虞', '喰', '空', '偶', '寓', '遇', '隅', '串',
              '櫛', '釧', '屑', '屈', '掘', '窟', '沓', '靴', '轡', '窪', '熊',
              '隈', '粂', '栗', '繰', '桑', '鍬', '勲', '君', '薫', '訓', '群',
              '軍', '郡']
  
  KANJI_KE = ['卦', '袈', '祁', '係', '傾', '刑', '兄', '啓', '圭', '珪', '型',
              '契', '形', '径', '恵', '慶', '慧', '憩', '掲', '携', '敬', '景',
              '桂', '渓', '畦', '稽', '系', '経', '継', '繋', '罫', '茎', '荊',
              '蛍', '計', '詣', '警', '軽', '頚', '鶏', '芸', '迎', '鯨', '劇',
              '戟', '撃', '激', '隙', '桁', '傑', '欠', '決', '潔', '穴', '結',
              '血', '訣', '月', '件', '倹', '倦', '健', '兼', '券', '剣', '喧',
              '圏', '堅', '嫌', '建', '憲', '懸', '拳', '捲', '検', '権', '牽',
              '犬', '献', '研', '硯', '絹', '県', '肩', '見', '謙', '賢', '軒',
              '遣', '鍵', '険', '顕', '験', '鹸', '元', '原', '厳', '幻', '弦',
              '減', '源', '玄', '現', '絃', '舷', '言', '諺', '限']
  
  KANJI_KO = ['乎', '個', '古', '呼', '固', '姑', '孤', '己', '庫', '弧', '戸',
              '故', '枯', '湖', '狐', '糊', '袴', '股', '胡', '菰', '虎', '誇',
              '跨', '鈷', '雇', '顧', '鼓', '五', '互', '伍', '午', '呉', '吾',
              '娯', '後', '御', '悟', '梧', '檎', '瑚', '碁', '語', '誤', '護',
              '醐', '乞', '鯉', '交', '佼', '侯', '候', '倖', '光', '公', '功',
              '効', '勾', '厚', '口', '向', '后', '喉', '坑', '垢', '好', '孔',
              '孝', '宏', '工', '巧', '巷', '幸', '広', '庚', '康', '弘', '恒',
              '慌', '抗', '拘', '控', '攻', '昂', '晃', '更', '杭', '校', '梗',
              '構', '江', '洪', '浩', '港', '溝', '甲', '皇', '硬', '稿', '糠',
              '紅', '紘', '絞', '綱', '耕', '考', '肯', '肱', '腔', '膏', '航',
              '荒', '行', '衡', '講', '貢', '購', '郊', '酵', '鉱', '砿', '鋼',
              '閤', '降', '項', '香', '高', '鴻', '剛', '劫', '号', '合', '壕',
              '拷', '濠', '豪', '轟', '麹', '克', '刻', '告', '国', '穀', '酷',
              '鵠', '黒', '獄', '漉', '腰', '甑', '忽', '惚', '骨', '狛', '込',
              '此', '頃', '今', '困', '坤', '墾', '婚', '恨', '懇', '昏', '昆',
              '根', '梱', '混', '痕', '紺', '艮', '魂']
  
  KANJI_SA = ['些', '佐', '叉', '唆', '嵯', '左', '差', '査', '沙', '瑳', '砂',
              '詐', '鎖', '裟', '坐', '座', '挫', '債', '催', '再', '最', '哉',
              '塞', '妻', '宰', '彩', '才', '採', '栽', '歳', '済', '災', '采',
              '犀', '砕', '砦', '祭', '斎', '細', '菜', '裁', '載', '際', '剤',
              '在', '材', '罪', '財', '冴', '坂', '阪', '堺', '榊', '肴', '咲',
              '崎', '埼', '碕', '鷺', '作', '削', '咋', '搾', '昨', '朔', '柵',
              '窄', '策', '索', '錯', '桜', '鮭', '笹', '匙', '冊', '刷', '察',
              '拶', '撮', '擦', '札', '殺', '薩', '雑', '皐', '鯖', '捌', '錆',
              '鮫', '皿', '晒', '三', '傘', '参', '山', '惨', '撒', '散', '桟',
              '燦', '珊', '産', '算', '纂', '蚕', '讃', '賛', '酸', '餐', '斬',
              '暫', '残']
  
  KANJI_SI = ['仕', '仔', '伺', '使', '刺', '司', '史', '嗣', '四', '士', '始',
              '姉', '姿', '子', '屍', '市', '師', '志', '思', '指', '支', '孜',
              '斯', '施', '旨', '枝', '止', '死', '氏', '獅', '祉', '私', '糸',
              '紙', '紫', '肢', '脂', '至', '視', '詞', '詩', '試', '誌', '諮',
              '資', '賜', '雌', '飼', '歯', '事', '似', '侍', '児', '字', '寺',
              '慈', '持', '時', '次', '滋', '治', '爾', '璽', '痔', '磁', '示',
              '而', '耳', '自', '蒔', '辞', '汐', '鹿', '式', '識', '鴫', '竺',
              '軸', '宍', '雫', '七', '叱', '執', '失', '嫉', '室', '悉', '湿',
              '漆', '疾', '質', '実', '蔀', '篠', '偲', '柴', '芝', '屡', '蕊',
              '縞', '舎', '写', '射', '捨', '赦', '斜', '煮', '社', '紗', '者',
              '謝', '車', '遮', '蛇', '邪', '借', '勺', '尺', '杓', '灼', '爵',
              '酌', '釈', '錫', '若', '寂', '弱', '惹', '主', '取', '守', '手',
              '朱', '殊', '狩', '珠', '種', '腫', '趣', '酒', '首', '儒', '受',
              '呪', '寿', '授', '樹', '綬', '需', '囚', '収', '周', '宗', '就',
              '州', '修', '愁', '拾', '洲', '秀', '秋', '終', '繍', '習', '臭',
              '舟', '蒐', '衆', '襲', '讐', '蹴', '輯', '週', '酋', '酬', '集',
              '醜', '什', '住', '充', '十', '従', '戎', '柔', '汁', '渋', '獣',
              '縦', '重', '銃', '叔', '夙', '宿', '淑', '祝', '縮', '粛', '塾',
              '熟', '出', '術', '述', '俊', '峻', '春', '瞬', '竣', '舜', '駿',
              '准', '循', '旬', '楯', '殉', '淳', '準', '潤', '盾', '純', '巡',
              '遵', '醇', '順', '処', '初', '所', '暑', '曙', '渚', '庶', '緒',
              '署', '書', '薯', '藷', '諸', '助', '叙', '女', '序', '徐', '恕',
              '鋤', '除', '傷', '償', '勝', '匠', '升', '召', '哨', '商', '唱',
              '嘗', '奨', '妾', '娼', '宵', '将', '小', '少', '尚', '庄', '床',
              '廠', '彰', '承', '抄', '招', '掌', '捷', '昇', '昌', '昭', '晶',
              '松', '梢', '樟', '樵', '沼', '消', '渉', '湘', '焼', '焦', '照',
              '症', '省', '硝', '礁', '祥', '称', '章', '笑', '粧', '紹', '肖',
              '菖', '蒋', '蕉', '衝', '裳', '訟', '証', '詔', '詳', '象', '賞',
              '醤', '鉦', '鍾', '鐘', '障', '鞘', '上', '丈', '丞', '乗', '冗',
              '剰', '城', '場', '壌', '嬢', '常', '情', '擾', '条', '杖', '浄',
              '状', '畳', '穣', '蒸', '譲', '醸', '錠', '嘱', '埴', '飾', '拭',
              '植', '殖', '燭', '織', '職', '色', '触', '食', '蝕', '辱', '尻',
              '伸', '信', '侵', '唇', '娠', '寝', '審', '心', '慎', '振', '新',
              '晋', '森', '榛', '浸', '深', '申', '疹', '真', '神', '秦', '紳',
              '臣', '芯', '薪', '親', '診', '身', '辛', '進', '針', '震', '人',
              '仁', '刃', '塵', '壬', '尋', '甚', '尽', '腎', '訊', '迅', '陣',
              '靭']
  
  KANJI_SU = ['笥', '諏', '須', '酢', '図', '厨', '逗', '吹', '垂', '帥', '推',
              '水', '炊', '睡', '粋', '翠', '衰', '遂', '酔', '錐', '錘', '随',
              '瑞', '髄', '崇', '嵩', '数', '枢', '趨', '雛', '据', '杉', '椙',
              '菅', '頗', '雀', '裾', '澄', '摺', '寸']
  
  KANJI_SE = ['世', '瀬', '畝', '是', '凄', '制', '勢', '姓', '征', '性', '成',
              '政', '整', '星', '晴', '棲', '栖', '正', '清', '牲', '生', '盛',
              '精', '聖', '声', '製', '西', '誠', '誓', '請', '逝', '醒', '青',
              '静', '斉', '税', '脆', '隻', '席', '惜', '戚', '斥', '昔', '析',
              '石', '積', '籍', '績', '脊', '責', '赤', '跡', '蹟', '碩', '切',
              '拙', '接', '摂', '折', '設', '窃', '節', '説', '雪', '絶', '舌',
              '蝉', '仙', '先', '千', '占', '宣', '専', '尖', '川', '戦', '扇',
              '撰', '栓', '栴', '泉', '浅', '洗', '染', '潜', '煎', '煽', '旋',
              '穿', '箭', '線', '繊', '羨', '腺', '舛', '船', '薦', '詮', '賎',
              '践', '選', '遷', '銭', '銑', '閃', '鮮', '前', '善', '漸', '然',
              '全', '禅', '繕', '膳', '糎']
  
  KANJI_SO = ['噌', '塑', '岨', '措', '曾', '曽', '楚', '狙', '疏', '疎', '礎',
              '祖', '租', '粗', '素', '組', '蘇', '訴', '阻', '遡', '鼠', '僧',
              '創', '双', '叢', '倉', '喪', '壮', '奏', '爽', '宋', '層', '匝',
              '惣', '想', '捜', '掃', '挿', '掻', '操', '早', '曹', '巣', '槍',
              '槽', '漕', '燥', '争', '痩', '相', '窓', '糟', '総', '綜', '聡',
              '草', '荘', '葬', '蒼', '藻', '装', '走', '送', '遭', '鎗', '霜',
              '騒', '像', '増', '憎', '臓', '蔵', '贈', '造', '促', '側', '則',
              '即', '息', '捉', '束', '測', '足', '速', '俗', '属', '賊', '族',
              '続', '卒', '袖', '其', '揃', '存', '孫', '尊', '損', '村', '遜']
  
  KANJI_TA = ['他', '多', '太', '汰', '詑', '唾', '堕', '妥', '惰', '打', '柁',
              '舵', '楕', '陀', '駄', '騨', '体', '堆', '対', '耐', '岱', '帯',
              '待', '怠', '態', '戴', '替', '泰', '滞', '胎', '腿', '苔', '袋',
              '貸', '退', '逮', '隊', '黛', '鯛', '代', '台', '大', '第', '醍',
              '題', '鷹', '滝', '瀧', '卓', '啄', '宅', '托', '択', '拓', '沢',
              '濯', '琢', '託', '鐸', '濁', '諾', '茸', '凧', '蛸', '只', '叩',
              '但', '達', '辰', '奪', '脱', '巽', '竪', '辿', '棚', '谷', '狸',
              '鱈', '樽', '誰', '丹', '単', '嘆', '坦', '担', '探', '旦', '歎',
              '淡', '湛', '炭', '短', '端', '箪', '綻', '耽', '胆', '蛋', '誕',
              '鍛', '団', '壇', '弾', '断', '暖', '檀', '段', '男', '談']
  
  KANJI_TI = ['値', '知', '地', '弛', '恥', '智', '池', '痴', '稚', '置', '致',
              '蜘', '遅', '馳', '築', '畜', '竹', '筑', '蓄', '逐', '秩', '窒',
              '茶', '嫡', '着', '中', '仲', '宙', '忠', '抽', '昼', '柱', '注',
              '虫', '衷', '註', '酎', '鋳', '駐', '樗', '瀦', '猪', '苧', '著',
              '貯', '丁', '兆', '凋', '喋', '寵', '帖', '帳', '庁', '弔', '張',
              '彫', '徴', '懲', '挑', '暢', '朝', '潮', '牒', '町', '眺', '聴',
              '脹', '腸', '蝶', '調', '諜', '超', '跳', '銚', '長', '頂', '鳥',
              '勅', '捗', '直', '朕', '沈', '珍', '賃', '鎮', '陳']
  
  KANJI_TU = ['津', '墜', '椎', '槌', '追', '鎚', '痛', '通', '塚', '栂', '掴',
              '槻', '佃', '漬', '柘', '辻', '蔦', '綴', '鍔', '椿', '潰', '坪',
              '壷', '嬬', '紬', '爪', '吊', '釣', '鶴']
  
  KANJI_TE = ['亭', '低', '停', '偵', '剃', '貞', '呈', '堤', '定', '帝', '底',
              '庭', '廷', '弟', '悌', '抵', '挺', '提', '梯', '汀', '碇', '禎',
              '程', '締', '艇', '訂', '諦', '蹄', '逓', '邸', '鄭', '釘', '鼎',
              '泥', '摘', '擢', '敵', '滴', '的', '笛', '適', '鏑', '溺', '哲',
              '徹', '撤', '轍', '迭', '鉄', '典', '填', '天', '展', '店', '添',
              '纏', '甜', '貼', '転', '顛', '点', '伝', '殿', '澱', '田', '電']
  
  KANJI_TO = ['兎', '吐', '堵', '塗', '妬', '屠', '徒', '斗', '杜', '渡', '登',
              '菟', '賭', '途', '都', '鍍', '砥', '砺', '努', '度', '土', '奴',
              '怒', '倒', '党', '冬', '凍', '刀', '唐', '塔', '塘', '套', '宕',
              '島', '嶋', '悼', '投', '搭', '東', '桃', '梼', '棟', '盗', '淘',
              '湯', '涛', '灯', '燈', '当', '痘', '祷', '等', '答', '筒', '糖',
              '統', '到', '董', '蕩', '藤', '討', '謄', '豆', '踏', '逃', '透',
              '鐙', '陶', '頭', '騰', '闘', '働', '動', '同', '堂', '導', '憧',
              '撞', '洞', '瞳', '童', '胴', '萄', '道', '銅', '峠', '鴇', '匿',
              '得', '徳', '涜', '特', '督', '禿', '篤', '毒', '独', '読', '栃',
              '橡', '凸', '突', '椴', '届', '鳶', '苫', '寅', '酉', '瀞', '噸',
              '屯', '惇', '敦', '沌', '豚', '遁', '頓', '呑', '曇', '鈍']
  
  KANJI_NA = ['奈', '那', '内', '乍', '凪', '薙', '謎', '灘', '捺', '鍋', '楢',
              '馴', '縄', '畷', '南', '楠', '軟', '難', '汝']
  
  KANJI_NI = ['二', '尼', '弐', '迩', '匂', '賑', '肉', '虹', '廿', '日', '乳',
              '入', '如', '尿', '韮', '任', '妊', '忍', '認']
  
  KANJI_NU = ['濡']
  
  KANJI_NE = ['禰', '祢', '寧', '葱', '猫', '熱', '年', '念', '捻', '撚', '燃',
              '粘']
  
  KANJI_NO = ['乃', '廼', '之', '埜', '嚢', '悩', '濃', '納', '能', '脳', '膿',
              '農', '覗', '蚤']
  
  KANJI_HA = ['巴', '把', '播', '覇', '杷', '波', '派', '琶', '破', '婆', '罵',
              '芭', '馬', '俳', '廃', '拝', '排', '敗', '杯', '盃', '牌', '背',
              '肺', '輩', '配', '倍', '培', '媒', '梅', '楳', '煤', '狽', '買',
              '売', '賠', '陪', '這', '蝿', '秤', '矧', '萩', '伯', '剥', '博',
              '拍', '柏', '泊', '白', '箔', '粕', '舶', '薄', '迫', '曝', '漠',
              '爆', '縛', '莫', '駁', '麦', '函', '箱', '硲', '箸', '肇', '筈',
              '櫨', '幡', '肌', '畑', '畠', '八', '鉢', '溌', '発', '醗', '髪',
              '伐', '罰', '抜', '筏', '閥', '鳩', '噺', '塙', '蛤', '隼', '伴',
              '判', '半', '反', '叛', '帆', '搬', '斑', '板', '氾', '汎', '版',
              '犯', '班', '畔', '繁', '般', '藩', '販', '範', '釆', '煩', '頒',
              '飯', '挽', '晩', '番', '盤', '磐', '蕃', '蛮']
  
  KANJI_HI = ['匪', '卑', '否', '妃', '庇', '彼', '悲', '扉', '批', '披', '斐',
              '比', '泌', '疲', '皮', '碑', '秘', '緋', '罷', '肥', '被', '誹',
              '費', '避', '非', '飛', '樋', '簸', '備', '尾', '微', '枇', '毘',
              '琵', '眉', '美', '鼻', '柊', '稗', '匹', '疋', '髭', '彦', '膝',
              '菱', '肘', '弼', '必', '畢', '筆', '逼', '桧', '姫', '媛', '紐',
              '百', '謬', '俵', '彪', '標', '氷', '漂', '瓢', '票', '表', '評',
              '豹', '廟', '描', '病', '秒', '苗', '錨', '鋲', '蒜', '蛭', '鰭',
              '品', '彬', '斌', '浜', '瀕', '貧', '賓', '頻', '敏', '瓶']
  
  KANJI_HU = ['不', '付', '埠', '夫', '婦', '富', '冨', '布', '府', '怖', '扶',
              '敷', '斧', '普', '浮', '父', '符', '腐', '膚', '芙', '譜', '負',
              '賦', '赴', '阜', '附', '侮', '撫', '武', '舞', '葡', '蕪', '部',
              '封', '楓', '風', '葺', '蕗', '伏', '副', '復', '幅', '服', '福',
              '腹', '複', '覆', '淵', '弗', '払', '沸', '仏', '物', '鮒', '分',
              '吻', '噴', '墳', '憤', '扮', '焚', '奮', '粉', '糞', '紛', '雰',
              '文', '聞']
  
  KANJI_HE = ['丙', '併', '兵', '塀', '幣', '平', '弊', '柄', '並', '蔽', '閉',
              '陛', '米', '頁', '僻', '壁', '癖', '碧', '別', '瞥', '蔑', '箆',
              '偏', '変', '片', '篇', '編', '辺', '返', '遍', '便', '勉', '娩',
              '弁', '鞭']
  
  KANJI_HO = ['保', '舗', '鋪', '圃', '捕', '歩', '甫', '補', '輔', '穂', '募',
              '墓', '慕', '戊', '暮', '母', '簿', '菩', '倣', '俸', '包', '呆',
              '報', '奉', '宝', '峰', '峯', '崩', '庖', '抱', '捧', '放', '方',
              '朋', '法', '泡', '烹', '砲', '縫', '胞', '芳', '萌', '蓬', '蜂',
              '褒', '訪', '豊', '邦', '鋒', '飽', '鳳', '鵬', '乏', '亡', '傍',
              '剖', '坊', '妨', '帽', '忘', '忙', '房', '暴', '望', '某', '棒',
              '冒', '紡', '肪', '膨', '謀', '貌', '貿', '鉾', '防', '吠', '頬',
              '北', '僕', '卜', '墨', '撲', '朴', '牧', '睦', '穆', '釦', '勃',
              '没', '殆', '堀', '幌', '奔', '本', '翻', '凡', '盆']
  
  KANJI_MA = ['摩', '磨', '魔', '麻', '埋', '妹', '昧', '枚', '毎', '哩', '槙',
              '幕', '膜', '枕', '鮪', '柾', '鱒', '桝', '亦', '俣', '又', '抹',
              '末', '沫', '迄', '侭', '繭', '麿', '万', '慢', '満', '漫', '蔓']
  
  KANJI_MI = ['味', '未', '魅', '巳', '箕', '岬', '密', '蜜', '湊', '蓑', '稔',
              '脈', '妙', '粍', '民', '眠']
  
  KANJI_MU = ['務', '夢', '無', '牟', '矛', '霧', '鵡', '椋', '婿', '娘']
  
  KANJI_ME = ['冥', '名', '命', '明', '盟', '迷', '銘', '鳴', '姪', '牝', '滅',
              '免', '棉', '綿', '緬', '面', '麺']
  
  KANJI_MO = ['摸', '模', '茂', '妄', '孟', '毛', '猛', '盲', '網', '耗', '蒙',
              '儲', '木', '黙', '目', '杢', '勿', '餅', '尤', '戻', '籾', '貰',
              '問', '悶', '紋', '門', '匁']
  
  KANJI_YA = ['也', '冶', '夜', '爺', '耶', '野', '弥', '矢', '厄', '役', '約',
              '薬', '訳', '躍', '靖', '柳', '薮', '鑓']
  
  KANJI_YU = ['愉', '愈', '油', '癒', '諭', '輸', '唯', '佑', '優', '勇', '友',
              '宥', '幽', '悠', '憂', '揖', '有', '柚', '湧', '涌', '猶', '猷',
              '由', '祐', '裕', '誘', '遊', '邑', '郵', '雄', '融', '夕']
  
  KANJI_YO = ['予', '余', '与', '誉', '輿', '預', '傭', '幼', '妖', '容', '庸',
              '揚', '揺', '擁', '曜', '楊', '様', '洋', '溶', '熔', '用', '窯',
              '羊', '耀', '葉', '蓉', '要', '謡', '踊', '遥', '陽', '養', '慾',
              '抑', '欲', '沃', '浴', '翌', '翼', '淀']
  
  KANJI_RA = ['羅', '螺', '裸', '来', '莱', '頼', '雷', '洛', '絡', '落', '酪',
              '乱', '卵', '嵐', '欄', '濫', '藍', '蘭', '覧']
  
  KANJI_RI = ['利', '吏', '履', '李', '梨', '理', '璃', '痢', '裏', '裡', '里',
              '離', '陸', '律', '率', '立', '葎', '掠', '略', '劉', '流', '溜',
              '琉', '留', '硫', '粒', '隆', '竜', '龍', '侶', '慮', '旅', '虜',
              '了', '亮', '僚', '両', '凌', '寮', '料', '梁', '涼', '猟', '療',
              '瞭', '稜', '糧', '良', '諒', '遼', '量', '陵', '領', '力', '緑',
              '倫', '厘', '林', '淋', '燐', '琳', '臨', '輪', '隣', '鱗', '麟']
  
  KANJI_RU = ['瑠', '塁', '涙', '累', '類']
  
  KANJI_RE = ['令', '伶', '例', '冷', '励', '嶺', '怜', '玲', '礼', '苓', '鈴',
              '隷', '零', '霊', '麗', '齢', '暦', '歴', '列', '劣', '烈', '裂',
              '廉', '恋', '憐', '漣', '煉', '簾', '練', '聯', '蓮', '連', '錬']
  
  KANJI_RO = ['呂', '魯', '櫓', '炉', '賂', '路', '露', '労', '婁', '廊', '弄',
              '朗', '楼', '榔', '浪', '漏', '牢', '狼', '篭', '老', '聾', '蝋',
              '郎', '六', '麓', '禄', '肋', '録', '論']
  
  KANJI_WA = ['倭', '和', '話', '歪', '賄', '脇', '惑', '枠', '鷲', '亙', '亘',
              '鰐', '詫', '藁', '蕨', '椀', '湾', '碗', '腕']
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(edit_window)
    y = edit_window.y + edit_window.height
    width = Graphics.width - 240
    super(240, y, width, 264, edit_window)
    self.z = 200
    if defined?(Window_NZPrism_Option)
      self.back_opacity = 204 + $game_system.w_opacity / 5
    end
    hide
  end
  #--------------------------------------------------------------------------
  # ● 文字表の取得
  #--------------------------------------------------------------------------
  def table
    [KANJI_A,  KANJI_I,  KANJI_U,  KANJI_E,  KANJI_O, 
     KANJI_KA, KANJI_KI, KANJI_KU, KANJI_KE, KANJI_KO, 
     KANJI_SA, KANJI_SI, KANJI_SU, KANJI_SE, KANJI_SO, 
     KANJI_TA, KANJI_TI, KANJI_TU, KANJI_TE, KANJI_TO, 
     KANJI_NA, KANJI_NI, KANJI_NU, KANJI_NE, KANJI_NO, 
     KANJI_HA, KANJI_HI, KANJI_HU, KANJI_HE, KANJI_HO, 
     KANJI_MA, KANJI_MI, KANJI_MU, KANJI_ME, KANJI_MO, 
     KANJI_YA, nil,      KANJI_YU, nil,      KANJI_YO, 
     KANJI_RA, KANJI_RI, KANJI_RU, KANJI_RE, KANJI_RO, 
     KANJI_WA]
  end
  #--------------------------------------------------------------------------
  # ● 桁数の取得
  #--------------------------------------------------------------------------
  def col_max
    width / 32
  end
  #--------------------------------------------------------------------------
  # ● 横に項目が並ぶときの空白の幅を取得
  #--------------------------------------------------------------------------
  def spacing
    0
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh
    create_contents
    super
  end
end

#==============================================================================
# ★ Window_NameCommand
#------------------------------------------------------------------------------
# 　名前入力画面で、全体に関わる選択をするウィンドウです。
#==============================================================================

class Window_NameCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● 定数
  #--------------------------------------------------------------------------
  HIRAGANA = "かな"
  KATAKANA = "カナ"
  ALPHABET = "英数"
  KANJI    = "漢字"
  OK       = "完了"
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(input_window)
    super(0, input_window.y)
    @input_window = input_window
  end
  #--------------------------------------------------------------------------
  # ● ウィンドウ幅の取得
  #--------------------------------------------------------------------------
  def window_width
    72
  end
  #--------------------------------------------------------------------------
  # ● 項目の描画
  #--------------------------------------------------------------------------
  def draw_item(index)
    color = (index == 4) ? system_color : normal_color
    change_color(color, command_enabled?(index))
    draw_text(item_rect_for_text(index), command_name(index), alignment)
  end
  #--------------------------------------------------------------------------
  # ● コマンドリストの作成
  #--------------------------------------------------------------------------
  def make_command_list
    add_command(HIRAGANA, :hiragana)
    add_command(KATAKANA, :katakana)
    add_command(ALPHABET, :alphabet)
    add_command(KANJI,    :kanji)
    add_command(OK,       :ok)
  end
  #--------------------------------------------------------------------------
  # ● 決定やキャンセルなどのハンドリング処理
  #--------------------------------------------------------------------------
  def process_handling
    return unless open? && active
    return process_ok     if ok_enabled?     && Input.trigger?(:C)
    return process_cancel if cancel_enabled? && Input.repeat?(:B)
  end
  #--------------------------------------------------------------------------
  # ● カーソルの移動処理
  #--------------------------------------------------------------------------
  def process_cursor_move
    return unless cursor_movable?
    last_index = @index
    cursor_down (Input.trigger?(:DOWN)) if Input.repeat?(:DOWN)
    cursor_up   (Input.trigger?(:UP))   if Input.repeat?(:UP)
    if @index != last_index
      Sound.play_cursor
      @input_window.change_page(@index) unless @index == 4
    end
  end
  #--------------------------------------------------------------------------
  # ● キャンセルボタンが押されたときの処理
  #--------------------------------------------------------------------------
  def process_cancel
    Input.update
    call_cancel_handler
  end
end
